In [14]:
import pandas as pd
from datetime import date, timedelta

In [15]:
books = pd.read_excel('Books.xlsx', skiprows= 3, usecols= 'C:F',index_col= None,
                     dtype= {'ID': str, 'InStore': str, 'Date': str})
start = date(2019,1,1)
for i in books.index:
    books['ID'].at[i]= i+1
    books['InStore'].at[i] = 'Yes' if i % 2 == 0 else 'No'
    books['Date'].at[i] = start
print(books)

    ID      Name InStore        Date
0    1  Book_001     Yes  2019-01-01
1    2  Book_002      No  2019-01-01
2    3  Book_003     Yes  2019-01-01
3    4  Book_004      No  2019-01-01
4    5  Book_005     Yes  2019-01-01
5    6  Book_006      No  2019-01-01
6    7  Book_007     Yes  2019-01-01
7    8  Book_008      No  2019-01-01
8    9  Book_009     Yes  2019-01-01
9   10  Book_010      No  2019-01-01
10  11  Book_011     Yes  2019-01-01
11  12  Book_012      No  2019-01-01
12  13  Book_013     Yes  2019-01-01
13  14  Book_014      No  2019-01-01
14  15  Book_015     Yes  2019-01-01
15  16  Book_016      No  2019-01-01
16  17  Book_017     Yes  2019-01-01
17  18  Book_018      No  2019-01-01
18  19  Book_019     Yes  2019-01-01
19  20  Book_020      No  2019-01-01

In [16]:
books = pd.read_excel('Books.xlsx', skiprows= 3, usecols= 'C: F', index_col= None)
                     #dtype= {'ID': str, 'inStore': str, 'Date': str})
books.head()

   ID      Name  InStore  Date
0 NaN  Book_001      NaN   NaN
1 NaN  Book_002      NaN   NaN
2 NaN  Book_003      NaN   NaN
3 NaN  Book_004      NaN   NaN
4 NaN  Book_005      NaN   NaN

In [23]:
books = pd.read_excel('Books.xlsx', skiprows= 3, usecols= 'C: F', index_col= None,
                     dtype= {'ID': str, 'InStore': str, 'Date': str})
books.head()

    ID      Name InStore Date
0  nan  Book_001     nan  nan
1  nan  Book_002     nan  nan
2  nan  Book_003     nan  nan
3  nan  Book_004     nan  nan
4  nan  Book_005     nan  nan

In [28]:
#建立一维表时，这个方法可以用到吧！

start = date(2019,11,11)
for i in books.index:
    books['ID'].at[i] = i + 1
    books['InStore'].at[i] = 'Yes' if i % 2 == 0 else 'No'
    books['Date'].at[i] = start
    
books

    ID      Name InStore        Date
0    1  Book_001     Yes  2019-11-11
1    2  Book_002      No  2019-11-11
2    3  Book_003     Yes  2019-11-11
3    4  Book_004      No  2019-11-11
4    5  Book_005     Yes  2019-11-11
5    6  Book_006      No  2019-11-11
6    7  Book_007     Yes  2019-11-11
7    8  Book_008      No  2019-11-11
8    9  Book_009     Yes  2019-11-11
9   10  Book_010      No  2019-11-11
10  11  Book_011     Yes  2019-11-11
11  12  Book_012      No  2019-11-11
12  13  Book_013     Yes  2019-11-11
13  14  Book_014      No  2019-11-11
14  15  Book_015     Yes  2019-11-11
15  16  Book_016      No  2019-11-11
16  17  Book_017     Yes  2019-11-11
17  18  Book_018      No  2019-11-11
18  19  Book_019     Yes  2019-11-11
19  20  Book_020      No  2019-11-11